# Інкапсуляція.

import requests

# У requests є клас Response, що інкапсулює дані відповіді від сервера.
response = requests.get("https://google.com/")

print(response.status_code)   # 200
print(response.text)          # HTML сторінки
print(response.headers)       # словник заголовків

# Поля, які зберігають сирі дані, типу сокет‑рівень, байти відповіді, приховані від користувача.
# Замість прямого доступу до внутрішніх структур, ми працюємо через геттери/властивості: status_code, text, headers.
# Це захищає користувача від помилок і робить API зрозумілим: нам не потрібно знати, як саме реалізовано HTTP‑парсинг.
# Це і є інкапсуляція - приховування внутрішніх деталей реалізації за простим інтерфейсом.

# Абстракція.

#Клас Session у requests абстрагує складність роботи з HTTP‑з’єднаннями
session = requests.Session()
session.get("https://0.0.0.0")
session.post("https://0.0.0.0/login", data={"user":"vadym","pass":"123"})

# Ми бачимо прості методи get(), post(), put(), delete().
# Але за ними прихована складна логіка: відкриття сокетів, повторні спроби, кукі‑менеджмент, SSL‑перевірка.
# Абстракція дозволяє працювати з HTTP як із високорівневим інтерфейсом, не думаючи про низькорівневі деталі.
# Це і є абстракція - ми взаємодіємо з концепцією "HTTP‑запит", а не з конкретними байтами чи TCP‑пакетами.

# Це все робить код читабельнішим - код виглядає як "запитати сторінку", а не як "відкрити сокет, відправити байти, розпарсити заголовки".
# Спрощує підтримку - якщо зміниться реалізація HTTP (наприклад, нові протоколи), нам не доведеться переписувати код, інтерфейс залишиться тим самим.
# Робить написання коду безпечніше - інкапсуляція захищає від неправильного використання внутрішніх механізмів.
# Робить код гнучкышим - абстракція дозволяє легко додавати нові можливості, типу як підтримку async, не змінюючи при чьому базовий API.